#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/FIAP-Lanchonete-G41/lambda-authorizer/runs/run-9yiKrbomLiz3T2cJ

Waiting for the plan to start...

Terraform v1.10.2
on linux_amd64
Initializing plugins and modules...
data.aws_lb.orders_nlb: Refreshing...
data.aws_iam_role.lab_role: Refreshing...
data.aws_lb.payments_nlb: Refreshing...
data.aws_lb.customers_nlb: Refreshing...
data.aws_apigatewayv2_vpc_link.vpc_link: Refreshing...
data.aws_lb.products_nlb: Refreshing...
data.aws_apigatewayv2_api.api_gateway: Refreshing...
data.aws_iam_role.lab_role: Refresh complete after 0s [id=LabRole]
aws_lambda_function.authorizer: Refreshing state... [id=cognito-authorizer]
data.aws_apigatewayv2_api.api_gateway: Refresh complete after 0s [id=anxxxo5qmh]
data.aws_apigatewayv2_vpc_link.vpc_link: Refresh complete after 0s [id=hy0r4n]
data.aws_lb.orders_nlb: Refresh complete after 0s [id=arn:aws:elasticloadbalancing:us-east-1:618998750984:loadbalancer/net/a28a5af4185654a2394e884f88db6c73/c825c25d6cfe666e]
data.aws_lb.products_nlb: Refresh complete after 0s [id=arn:aws:elasticloadbalancing:us-east-1:618998750984:loadbalancer/net/a82549cde4112443b86b630558db9f6c/73ea8fe8d54806b5]
data.aws_lb.payments_nlb: Refresh complete after 0s [id=arn:aws:elasticloadbalancing:us-east-1:618998750984:loadbalancer/net/af1e8546225d448c084dce3f7eb8b014/c7d60b1dc90561a8]
data.aws_lb.customers_nlb: Refresh complete after 0s [id=arn:aws:elasticloadbalancing:us-east-1:618998750984:loadbalancer/net/a7d26181f4f424600aaef099a83515ec/e2280376b546c2a4]
data.aws_lb_listener.orders_listener: Refreshing...
data.aws_lb_listener.products_listener: Refreshing...
data.aws_lb_listener.payments_listener: Refreshing...
data.aws_lb_listener.customers_listener: Refreshing...
data.aws_lb_listener.orders_listener: Refresh complete after 0s [id=arn:aws:elasticloadbalancing:us-east-1:618998750984:listener/net/a28a5af4185654a2394e884f88db6c73/c825c25d6cfe666e/fb65dffc4afebe4a]
data.aws_lb_listener.payments_listener: Refresh complete after 0s [id=arn:aws:elasticloadbalancing:us-east-1:618998750984:listener/net/af1e8546225d448c084dce3f7eb8b014/c7d60b1dc90561a8/14b33d53c6d7371a]
aws_apigatewayv2_integration.payments_integration: Refreshing state... [id=42jrhg8]
data.aws_lb_listener.customers_listener: Refresh complete after 0s [id=arn:aws:elasticloadbalancing:us-east-1:618998750984:listener/net/a7d26181f4f424600aaef099a83515ec/e2280376b546c2a4/ab1ad91479797820]
aws_apigatewayv2_integration.customers_integration: Refreshing state... [id=4wmipm7]
data.aws_lb_listener.products_listener: Refresh complete after 0s [id=arn:aws:elasticloadbalancing:us-east-1:618998750984:listener/net/a82549cde4112443b86b630558db9f6c/73ea8fe8d54806b5/f1b4bf5a96c8ebf4]
aws_apigatewayv2_integration.products_integration: Refreshing state... [id=4akf4kv]
aws_apigatewayv2_authorizer.lambda_authorizer: Refreshing state... [id=o9c56i]
aws_apigatewayv2_route.payments_root_route: Refreshing state... [id=pdf9n6q]
aws_apigatewayv2_route.payments_docs_route: Refreshing state... [id=t63x02t]
aws_apigatewayv2_route.payments_route: Refreshing state... [id=3wa79qi]
aws_apigatewayv2_route.customers_route: Refreshing state... [id=7sk644c]
aws_apigatewayv2_route.customers_root_route: Refreshing state... [id=enuuoml]
aws_apigatewayv2_route.customers_docs_route: Refreshing state... [id=9kmw7jr]
aws_apigatewayv2_route.products_route: Refreshing state... [id=ibru1ls]
aws_apigatewayv2_route.products_root_route: Refreshing state... [id=m3brlsg]
aws_apigatewayv2_route.products_docs_route: Refreshing state... [id=b29xggh]
aws_apigatewayv2_route.products_docs_route: Drift detected (update)
aws_apigatewayv2_route.customers_docs_route: Drift detected (update)
aws_apigatewayv2_route.customers_root_route: Drift detected (update)
aws_apigatewayv2_route.payments_docs_route: Drift detected (update)
aws_apigatewayv2_route.payments_root_route: Drift detected (update)
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "rds_db_name" but a value
│ was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-9yiKrbomLiz3T2cJ/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "rds_password" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-9yiKrbomLiz3T2cJ/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Values for undeclared variables
│
│ In addition to the other similar warnings shown, 1 other variable(s)
│ defined without being declared.
╵

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_apigatewayv2_integration.orders_integration will be created
  + resource "aws_apigatewayv2_integration" "orders_integration" {
      + api_id                                    = "anxxxo5qmh"
      + connection_id                             = "hy0r4n"
      + connection_type                           = "VPC_LINK"
      + id                                        = (known after apply)
      + integration_method                        = "ANY"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "HTTP_PROXY"
      + integration_uri                           = "arn:aws:elasticloadbalancing:us-east-1:618998750984:listener/net/a28a5af4185654a2394e884f88db6c73/c825c25d6cfe666e/fb65dffc4afebe4a"
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_route.orders_docs_route will be created
  + resource "aws_apigatewayv2_route" "orders_docs_route" {
      + api_id             = "anxxxo5qmh"
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "ANY /orders-docs"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_route.orders_root_route will be created
  + resource "aws_apigatewayv2_route" "orders_root_route" {
      + api_id             = "anxxxo5qmh"
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "ANY /orders"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_route.orders_route will be created
  + resource "aws_apigatewayv2_route" "orders_route" {
      + api_id             = "anxxxo5qmh"
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "ANY /orders/{proxy+}"
      + target             = (known after apply)
    }

  # aws_lambda_function.authorizer will be updated in-place
  ~ resource "aws_lambda_function" "authorizer" {
        id                             = "cognito-authorizer"
      ~ last_modified                  = "2025-02-19T16:00:19.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:618998750984:function:cognito-authorizer:3" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:618998750984:function:cognito-authorizer:3/invocations" -> (known after apply)
      ~ source_code_hash               = "bNrMHApjIlT36x7YBBZVloZuQXv7a89RdJYKLVk5MnY=" -> "kd4sTeS+12nQAJJbE3tKkv+mGcq4B681Lu6Wke3wKtA="
        tags                           = {}
      ~ version                        = "3" -> (known after apply)
        # (24 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 4 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @rafaelvmasc, Action: `pull_request`*